cram-sheet.org
#+TITLE: Qualifying Exam Cram Sheet
#+LATEX_HEADER: \usepackage{jm}
#+LATEX_HEADER: \renewcommand{\HH}{\mathbf{H}}
#+LATEX_HEADER: \newcommand{\DD}{\mathbf{D}}
#+LATEX_HEADER: \newcommand{\MM}{\mathbf{M}}
#+LATEX_HEADER: \newcommand{\PP}{\mathbf{P}}
#+LATEX_HEADER: \newcommand{\mm}{\mathbf{m}}
#+LATEX_HEADER: \newcommand{\oo}{\boldsymbol{\omega}}
#+LATEX_HEADER: \renewcommand{\SS}{\mathbf{S}}
#+STARTUP: latexpreview
#+OPTIONS: tex:dvipng

\newpage
* Electromagnetism
** Basics
*** Maxwell's equations
\begin{align*}
\del \cdot \DD & = \rho & \del \cdot \BB & = 0 \\
\del \times \EE & = -\pd{\BB}{t} & \del \times \HH & = \JJ + \pd{\DD}{t}
\end{align*}
*** Lorentz Force Law
\begin{align*}
\FF & = q(\EE + \vv \times \BB)
\end{align*}

*** Definition of $\DD$ and $\HH$
In terms of $\PP$ and $\MM$,
\begin{align*}
\DD & = \eps_0 \EE + \PP \\
\HH & = \frac{1}{\mu_0} \BB - \MM
\end{align*}
In linear media,
\begin{align*}
\DD & = \eps \EE \\
\HH & = \frac{1}{\mu} \BB
\end{align*}
*** Potentials
\begin{align*}
\EE & = -\del \Phi &           \Phi(\xxx) & = \frac{1}{4\pi \eps_0} \int \frac{\rho(\xxx')}{\left| \xxx - \xxx' \right|} d^3 x'
                                            + \frac{1}{4\pi \eps_0} \oint \frac{\sigma(\xxx')}{\left| \xxx - \xxx' \right|} da  \\
\BB & = \del \times \AA &      \AA(\xxx) & = \frac{\mu_0}{4\pi} \int \frac{\JJ(\xxx')}{\left| \xxx - \xxx' \right|} d^3 x'
\end{align*}
*** Charge Density
\begin{align*}
\sigma & = -\eps_0 \pd{\Phi}{\hat{n}}
\end{align*}

** Laplace's Equation and Solutions
In a source free region, both $\EE$ and $\HH$ can be written as the gradient of a scalar potential which satisfies Laplace's equation,
\begin{align*}
\nabla^2 \Phi & = 0
\end{align*}
*** 2D Rectangular Coordinates
\begin{align*}
\Phi(x,y) & = \sum_k (A_k \sinh(kx) + B_k \cosh(kx)) (C_k \sin(ky) + D_k \cos(ky))
\end{align*}
Coefficients and allowed values of $k$ are determined by boundary conditions
*** 2D Polar Coordinates
\begin{align*}
\Phi(r, \phi) & = \sum_n (A_n r^n + B_n r^{-n}) (C_n \cos n\phi + D_n \sin n\phi)
\end{align*}
*** 3D Spherical with Azimuthal Symmetry
\begin{align*}
\Phi(r, \theta) & = \sum_l \left( A_l r^l + \frac{B_l}{r^{l+1}} \right) P_l(\cos \theta)
\end{align*}
*** 3D Spherical without Azimuthal Symmetry
\begin{align*}
\Phi(r, \theta) & = \sum_{l,m} \left( A_l r^l + \frac{B_l}{r^{l+1}} \right) Y_{lm}(\theta, \phi)
\end{align*}
** The Addition Theorem
\begin{align*}
\frac{1}{\left| \xxx - \xxx' \right|} & = 4\pi \sum_l \sum_m \frac{1}{2l+1} \frac{r_<^l}{r_>^{l+1}} Y_{lm}^*(\theta', \phi') Y_{lm}(\theta, \phi)
\end{align*}
** The Multipole Expansion
*** Spherical Coordinates
\begin{align*}
\Phi(\xxx) & = \frac{1}{4\pi \eps_0} \sum_l \sum_m \frac{4\pi}{2l+1} q_{lm} \frac{Y_{lm}(\theta, \phi)}{r^{l+1}} \\
q_{lm} & = \int Y_{lm}^*(\theta', \phi') r^{\prime l} \rho(\xxx') \, d^3 x'
\end{align*}
*** Rectangular Dipole and Quadrupole Moments
\begin{align*}
\pp & = \int \xxx' \rho(\xxx') \, d^3 x' \\
Q_{ij} & = \int (3x_i' x_j' - r^{\prime 2} \delta_{ij}) \rho(\xxx') \, d^3 x' \\
\Phi(\xxx) & = \frac{1}{4\pi \eps_0} \left[ \frac{q}{r} + \frac{\pp \cdot \xxx}{r^3}
+ \frac{1}{2} \sum_{i,j} Q_{ij} \frac{x_i x_j}{r^5} \right]
\end{align*}
** Magnetism
*** Magnetic Field Due to Current Distribution
\begin{align*}
\BB & = \frac{\mu_0}{4\pi} \int \JJ(\xxx') \frac{\xxx - \xxx'}{\left| \xxx - \xxx' \right|} d^3 x'
\end{align*}
*** Magnetic Dipole Moment
\begin{align*}
\mm & = \frac{1}{2} \int \xxx' \times \JJ(\xxx') \, d^3 x' \\
m & = I A & \mbox{(for a loop)} \\
\BB & = \frac{\mu_0}{4\pi} \frac{3\nn (\nn \cdot \mm) - \mm}{r^3}
\end{align*}
*** Magnetostatic Boundary Value Problems
**** Source Free
\begin{align*}
\HH & = -\del \Phi_M \\
\nabla^2 \Phi_M & = 0
\end{align*}
**** Hard Ferromagnets ($\MM$ given)
\begin{align*}
\rho_M & = -\del \cdot \MM \\
\sigma_M & = \nn \cdot \MM \\
\Phi_M(\xxx) & = \frac{1}{4\pi} \int \frac{\rho_M(\xxx')}{\left| \xxx - \xxx' \right|} \, d^3 x'
               + \frac{1}{4\pi} \oint \frac{\sigma_M(\xxx')}{\left| \xxx - \xxx' \right|} \, da
\end{align*}
** Boundary Value Problem Matching Conditions
\begin{align*}
(\DD_2 - \DD_1) \cdot \nn & = \sigma \\
(\EE_2 - \EE_1) \times \nn & = 0 \\
(\BB_2 - \BB_1) \cdot \nn & = 0 \\
(\HH_2 - \HH_1) \times \nn & = -\mathbf{K} \mbox{ (surface current density)}
\end{align*}
** Field Energy and Momentum
*** Energy Density
\begin{align*}
u & = \frac{1}{2} (\EE \cdot \DD + \BB \cdot \HH)
\end{align*}
*** Momentum Density
\begin{align*}
\mathbf{g} & = \frac{1}{c^2} \SS \\
\SS & = \EE \times \HH
\end{align*}
*** Energy Conservation
\begin{align*}
\pd{u}{t} + \del \cdot \SS & = -\JJ \cdot \EE
\end{align*}
** Electromagnetic Waves
*** Equations
\begin{align*}
\EE & = \EE_0 e^{i(k \nn \cdot \xxx - \omega t)} \\
\HH & = \nn \times \EE / Z
\end{align*}
*** Reflection/Refraction
**** Index of Refraction
\begin{align*}
n & = \sqrt{\frac{\mu \eps}{\mu_0 \eps_0}}
\end{align*}
**** Normal Incidence
- Transverse components of $\EE$ and $\HH$ are continuous
- Reflection and transmission coefficients:
\begin{align*}
T & = \frac{2n}{n' + n} \\
R & = \pm \frac{n-n'}{n+n'} \\
\end{align*}
** Radiation
*** Power Radiated
\begin{align*}
\td{P}{\Omega} & = \frac{1}{2} \mathrm{Re} [r^2 \nn \cdot \EE \times \HH^*] \\
& = \frac{c^2 Z_0}{32 \pi^2} k^4 \left| (\nn \times \pp) \times \nn \right|^2 \mbox{ (for dipole radiation)}
\end{align*}
** Relativity
\begin{align*}
\gamma & = \frac{1}{\sqrt{1 - \beta^2}} \\
\Gamma & = \left( \begin{array}{cccc}
                  \gamma & \pm \gamma \beta & 0 & 0 \\
                  \pm \gamma \beta & \gamma & 0 & 0 \\
                  0 & 0 & 1 & 0 \\
                  0 & 0 & 0 & 1 \\ \end{array} \right) \\
p_\mu p^\mu & = m^2 \\
E & = \gamma m c^2 \\
\pp & = \gamma m \uu \\
U_\mu & = (\gamma c, \gamma \uu) \\
p_\mu & = m U_\mu
\end{align*}





\newpage
* Mechanics
** Basics
\begin{align*}
\FF & = \dot{\pp} \\
\boldsymbol{\Gamma} & = \rrr \times \FF \\
\LL & = \rrr \times \pp
\end{align*}
** Orbital Motion
\begin{align*}
V_{eff}(r) & = V(r) + \frac{\ell^2}{2mr^2}
\end{align*}
- Circular orbits $\rightarrow$ minimum of $V_{eff}$
- Minimum and maximum $r$ values for a non-circular orbit $\rightarrow$ solutions of $V_{eff} = E$
\begin{align*}
\phi & = \pm \frac{\ell}{\sqrt{2m}} \int dr \, r^{-2} [E - V_{eff}(r)]^{-1/2}
\end{align*}
** Non-inertial Coordinate Systems
\begin{align*}
\ddot{\rrr}_{body} & = \frac{\FF^{(e)}}{m} - \ddot{\mathbf{a}}_{inertial} - 2\oo \times \dot{\rrr}_{body}
- \oo \times (\oo \times \rr) - \dot{\oo} \times \rrr
\end{align*}
