cram-sheet.tex
% Created 2021-08-12 Thu 10:18
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{jm}
\renewcommand{\HH}{\mathbf{H}}
\newcommand{\DD}{\mathbf{D}}
\newcommand{\MM}{\mathbf{M}}
\newcommand{\PP}{\mathbf{P}}
\newcommand{\mm}{\mathbf{m}}
\newcommand{\oo}{\boldsymbol{\omega}}
\renewcommand{\SS}{\mathbf{S}}
\author{John Mastroberti}
\date{\today}
\title{Qualifying Exam Cram Sheet}
\hypersetup{
 pdfauthor={John Mastroberti},
 pdftitle={Qualifying Exam Cram Sheet},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\newpage
\section{Electromagnetism}
\label{sec:orgbb406d8}
\subsection{Basics}
\label{sec:orgefee42a}
\subsubsection{Maxwell's equations}
\label{sec:org08a4c67}
\begin{align*}
\del \cdot \DD & = \rho & \del \cdot \BB & = 0 \\
\del \times \EE & = -\pd{\BB}{t} & \del \times \HH & = \JJ + \pd{\DD}{t}
\end{align*}
\subsubsection{Lorentz Force Law}
\label{sec:org20761d2}
\begin{align*}
\FF & = q(\EE + \vv \times \BB)
\end{align*}

\subsubsection{Definition of \(\DD\) and \(\HH\)}
\label{sec:org654188f}
In terms of \(\PP\) and \(\MM\),
\begin{align*}
\DD & = \eps_0 \EE + \PP \\
\HH & = \frac{1}{\mu_0} \BB - \MM
\end{align*}
In linear media,
\begin{align*}
\DD & = \eps \EE \\
\HH & = \frac{1}{\mu} \BB
\end{align*}
\subsubsection{Potentials}
\label{sec:orgf699c1c}
\begin{align*}
\EE & = -\del \Phi &           \Phi(\xxx) & = \frac{1}{4\pi \eps_0} \int \frac{\rho(\xxx')}{\left| \xxx - \xxx' \right|} d^3 x'
                                            + \frac{1}{4\pi \eps_0} \oint \frac{\sigma(\xxx')}{\left| \xxx - \xxx' \right|} da  \\
\BB & = \del \times \AA &      \AA(\xxx) & = \frac{\mu_0}{4\pi} \int \frac{\JJ(\xxx')}{\left| \xxx - \xxx' \right|} d^3 x'
\end{align*}
\subsubsection{Charge Density}
\label{sec:org061a651}
\begin{align*}
\sigma & = -\eps_0 \pd{\Phi}{\hat{n}}
\end{align*}

\subsection{Laplace's Equation and Solutions}
\label{sec:org1708958}
In a source free region, both \(\EE\) and \(\HH\) can be written as the gradient of a scalar potential which satisfies Laplace's equation,
\begin{align*}
\nabla^2 \Phi & = 0
\end{align*}
\subsubsection{2D Rectangular Coordinates}
\label{sec:orgbd3f542}
\begin{align*}
\Phi(x,y) & = \sum_k (A_k \sinh(kx) + B_k \cosh(kx)) (C_k \sin(ky) + D_k \cos(ky))
\end{align*}
Coefficients and allowed values of \(k\) are determined by boundary conditions
\subsubsection{2D Polar Coordinates}
\label{sec:org4b5ba68}
\begin{align*}
\Phi(r, \phi) & = \sum_n (A_n r^n + B_n r^{-n}) (C_n \cos n\phi + D_n \sin n\phi)
\end{align*}
\subsubsection{3D Spherical with Azimuthal Symmetry}
\label{sec:org2b71fa4}
\begin{align*}
\Phi(r, \theta) & = \sum_l \left( A_l r^l + \frac{B_l}{r^{l+1}} \right) P_l(\cos \theta)
\end{align*}
\subsubsection{3D Spherical without Azimuthal Symmetry}
\label{sec:org024c555}
\begin{align*}
\Phi(r, \theta) & = \sum_{l,m} \left( A_l r^l + \frac{B_l}{r^{l+1}} \right) Y_{lm}(\theta, \phi)
\end{align*}
\subsection{The Addition Theorem}
\label{sec:org576bded}
\begin{align*}
\frac{1}{\left| \xxx - \xxx' \right|} & = 4\pi \sum_l \sum_m \frac{1}{2l+1} \frac{r_<^l}{r_>^{l+1}} Y_{lm}^*(\theta', \phi') Y_{lm}(\theta, \phi)
\end{align*}
\subsection{The Multipole Expansion}
\label{sec:orgf3ec7c4}
\subsubsection{Spherical Coordinates}
\label{sec:orga61f4e8}
\begin{align*}
\Phi(\xxx) & = \frac{1}{4\pi \eps_0} \sum_l \sum_m \frac{4\pi}{2l+1} q_{lm} \frac{Y_{lm}(\theta, \phi)}{r^{l+1}} \\
q_{lm} & = \int Y_{lm}^*(\theta', \phi') r^{\prime l} \rho(\xxx') \, d^3 x'
\end{align*}
\subsubsection{Rectangular Dipole and Quadrupole Moments}
\label{sec:org91c2fc3}
\begin{align*}
\pp & = \int \xxx' \rho(\xxx') \, d^3 x' \\
Q_{ij} & = \int (3x_i' x_j' - r^{\prime 2} \delta_{ij}) \rho(\xxx') \, d^3 x' \\
\Phi(\xxx) & = \frac{1}{4\pi \eps_0} \left[ \frac{q}{r} + \frac{\pp \cdot \xxx}{r^3}
+ \frac{1}{2} \sum_{i,j} Q_{ij} \frac{x_i x_j}{r^5} \right]
\end{align*}
\subsection{Magnetism}
\label{sec:orgb52da8b}
\subsubsection{Magnetic Field Due to Current Distribution}
\label{sec:orga730855}
\begin{align*}
\BB & = \frac{\mu_0}{4\pi} \int \JJ(\xxx') \frac{\xxx - \xxx'}{\left| \xxx - \xxx' \right|} d^3 x'
\end{align*}
\subsubsection{Magnetic Dipole Moment}
\label{sec:org0febd6c}
\begin{align*}
\mm & = \frac{1}{2} \int \xxx' \times \JJ(\xxx') \, d^3 x' \\
m & = I A & \mbox{(for a loop)} \\
\BB & = \frac{\mu_0}{4\pi} \frac{3\nn (\nn \cdot \mm) - \mm}{r^3}
\end{align*}
\subsubsection{Magnetostatic Boundary Value Problems}
\label{sec:org94623f9}
\begin{enumerate}
\item Source Free
\label{sec:org38e6e25}
\begin{align*}
\HH & = -\del \Phi_M \\
\nabla^2 \Phi_M & = 0
\end{align*}
\item Hard Ferromagnets (\(\MM\) given)
\label{sec:org9bee4dc}
\begin{align*}
\rho_M & = -\del \cdot \MM \\
\sigma_M & = \nn \cdot \MM \\
\Phi_M(\xxx) & = \frac{1}{4\pi} \int \frac{\rho_M(\xxx')}{\left| \xxx - \xxx' \right|} \, d^3 x'
               + \frac{1}{4\pi} \oint \frac{\sigma_M(\xxx')}{\left| \xxx - \xxx' \right|} \, da
\end{align*}
\end{enumerate}
\subsection{Boundary Value Problem Matching Conditions}
\label{sec:org1190639}
\begin{align*}
(\DD_2 - \DD_1) \cdot \nn & = \sigma \\
(\EE_2 - \EE_1) \times \nn & = 0 \\
(\BB_2 - \BB_1) \cdot \nn & = 0 \\
(\HH_2 - \HH_1) \times \nn & = -\mathbf{K} \mbox{ (surface current density)}
\end{align*}
\subsection{Field Energy and Momentum}
\label{sec:org3bdef52}
\subsubsection{Energy Density}
\label{sec:orgf618143}
\begin{align*}
u & = \frac{1}{2} (\EE \cdot \DD + \BB \cdot \HH)
\end{align*}
\subsubsection{Momentum Density}
\label{sec:org14cc533}
\begin{align*}
\mathbf{g} & = \frac{1}{c^2} \SS \\
\SS & = \EE \times \HH
\end{align*}
\subsubsection{Energy Conservation}
\label{sec:org7d48afe}
\begin{align*}
\pd{u}{t} + \del \cdot \SS & = -\JJ \cdot \EE
\end{align*}
\subsection{Electromagnetic Waves}
\label{sec:org56f9cda}
\subsubsection{Equations}
\label{sec:org98e7cf2}
\begin{align*}
\EE & = \EE_0 e^{i(k \nn \cdot \xxx - \omega t)} \\
\HH & = \nn \times \EE / Z
\end{align*}
\subsubsection{Reflection/Refraction}
\label{sec:org189cdc0}
\begin{enumerate}
\item Index of Refraction
\label{sec:org5a69c09}
\begin{align*}
n & = \sqrt{\frac{\mu \eps}{\mu_0 \eps_0}}
\end{align*}
\item Normal Incidence
\label{sec:org8878996}
\begin{itemize}
\item Transverse components of \(\EE\) and \(\HH\) are continuous
\item Reflection and transmission coefficients:
\end{itemize}
\begin{align*}
T & = \frac{2n}{n' + n} \\
R & = \pm \frac{n-n'}{n+n'} \\
\end{align*}
\end{enumerate}
\subsection{Radiation}
\label{sec:orgeaa14b5}
\subsubsection{Power Radiated}
\label{sec:org3304da7}
\begin{align*}
\td{P}{\Omega} & = \frac{1}{2} \mathrm{Re} [r^2 \nn \cdot \EE \times \HH^*] \\
& = \frac{c^2 Z_0}{32 \pi^2} k^4 \left| (\nn \times \pp) \times \nn \right|^2 \mbox{ (for dipole radiation)}
\end{align*}
\subsection{Relativity}
\label{sec:orgec17e24}
\begin{align*}
\gamma & = \frac{1}{\sqrt{1 - \beta^2}} \\
\Gamma & = \left( \begin{array}{cccc}
                  \gamma & \pm \gamma \beta & 0 & 0 \\
                  \pm \gamma \beta & \gamma & 0 & 0 \\
                  0 & 0 & 1 & 0 \\
                  0 & 0 & 0 & 1 \\ \end{array} \right) \\
p_\mu p^\mu & = m^2 \\
E & = \gamma m c^2 \\
\pp & = \gamma m \uu \\
U_\mu & = (\gamma c, \gamma \uu) \\
p_\mu & = m U_\mu
\end{align*}





\newpage
\section{Mechanics}
\label{sec:org79e6cb9}
\subsection{Basics}
\label{sec:org7a2db35}
\begin{align*}
\FF & = \dot{\pp} \\
\boldsymbol{\Gamma} & = \rrr \times \FF \\
\LL & = \rrr \times \pp
\end{align*}
\subsection{Orbital Motion}
\label{sec:org909c331}
\begin{align*}
V_{eff}(r) & = V(r) + \frac{\ell^2}{2mr^2}
\end{align*}
\begin{itemize}
\item Circular orbits \(\rightarrow\) minimum of \(V_{eff}\)
\item Minimum and maximum \(r\) values for a non-circular orbit \(\rightarrow\) solutions of \(V_{eff} = E\)
\end{itemize}
\begin{align*}
\phi & = \pm \frac{\ell}{\sqrt{2m}} \int dr \, r^{-2} [E - V_{eff}(r)]^{-1/2}
\end{align*}
\subsection{Non-inertial Coordinate Systems}
\label{sec:org5a0c685}
\begin{align*}
\ddot{\rrr}_{body} & = \frac{\FF^{(e)}}{m} - \ddot{\mathbf{a}}_{inertial} - 2\oo \times \dot{\rrr}_{body}
- \oo \times (\oo \times \rr) - \dot{\oo} \times \rrr
\end{align*}
