cram-sheet.org
** Lagrangian Dynamics
\begin{align*}
\Lg & = T - V \\
\pd{\Lg}{q} & = \td{}{t} \pd{\Lg}{\dot{q}}
\end{align*}

With constraints
\begin{align*}
f_j(q_1, \ldots, q_n, t) & = c_j, \, j = 1, \ldots, k
\end{align*}
the Euler-Lagrange equation becomes
\begin{align*}
\td{\Lg}{\dot{q}_\sigma} - \pd{\Lg}{q_\sigma} & = \sum_{j=1}^k \lambda_j \pd{f_j}{q_\sigma}, \, \sigma = 1, \ldots, n
\end{align*}
where the constraint forces are given by the right hand side,
\begin{align*}
Q_\sigma & = \sum_{j=1}^k \lambda_j \pd{f_j}{q_\sigma}
\end{align*}

** Small Oscillations
First, expand the coordinates around their equilibrium values:
\begin{align*}
q_\sigma & = q_\sigma^0 + \eta_\sigma \\
\dot{q}_\sigma & = \dot{\eta}_\sigma
\end{align*}
Then, working to quadratic order in $\eta$, write $T$ and $V$ as
\begin{align*}
T & = \frac{1}{2} \sum_\sigma \sum_\lambda m_{\sigma \lambda} \dot{\eta}_\sigma \dot{\eta}_\lambda \\
V & = \frac{1}{2} \sum_\sigma \sum_\lambda v_{\sigma \lambda} \eta_\sigma \eta_\lambda
\end{align*}
This determines the $\underline{m}$ and $\underline{v}$ matrices.
Finally, the normal mode frequencies are found via
\begin{align*}
0 & = \det [ \underline{v} - \omega^2 \underline{m} ]
\end{align*}
and the normal mode eigenvectors $\boldsymbol{\rho}$ via
\begin{align*}
0 & = (\underline{v} - \omega^2 \underline{m}) \boldsymbol{\rho}
\end{align*}

** Rigid Body Rotations
\begin{align*}
\LL & = \underline{I} \oo \\
T & = \frac{1}{2} \LL \cdot \oo \\
I_1 \dot{\omega}_1 & = \omega_2 \omega_3 (I_2 - I_3) + \Gamma_1^{(e)} \mbox{ (and cyclic permutations)}
\end{align*}


\newpage
* Quantum Mechanics
** Basics
\begin{align*}
i\hbar \pd{}{t} \Psi(\xxx,t) & = H\Psi(\xxx, t) \\
H\psi(\xxx) & = E\psi(\xxx) \\
\psi(\xxx, t) & = \sum_n c_n \psi_n(\xxx) e^{-iEt/\hbar} \\
H & = \frac{p^2}{2m} + V \\
p & = -i\hbar \pd{}{x} \\
[x, p] & = i\hbar \\
\sigma_A \sigma_B & \ge \left| \frac{1}{2i} \Braket{[A, B]} \right|
\end{align*}
- Matching conditions: $\psi(x)$ and $\psi'(x)$ are continuous
  - $\psi'(x)$ is discontinous in the presence of a delta function potential
  - In that case, determine the discontinuity in $\psi'(x)$ by integrating the Schrodinger
    equation over a small interval surrounding the delta function

** Common Potentials
*** Particle in a Box
\begin{align*}
V(x) & = \begin{dcases*}
            0 & $x \in [0, a]$ \\
            \infty & otherwise \\
         \end{dcases*} \\
\psi_n(x) & = \sqrt{\frac{2}{a}} \sin \frac{n \pi x}{a} \\
E_n & = \frac{\hbar^2 n^2 \pi^2}{2ma^2}
\end{align*}
*** Simple Harmonic Oscillator
\begin{align*}
V(x) & = \frac{1}{2} m \omega^2 x^2 \\
a & = \frac{1}{\sqrt{2\hbar m \omega}} (m\omega x + ip) \\
[a, a^\dagger] & = 1 \\
N & = a^\dagger a \\
H & = \hbar \omega \left( N + \frac{1}{2} \right) \\
E_n & = \hbar \omega \left( n + \frac{1}{2} \right) \\
\psi_0(x) & = \left( \frac{m\omega}{\pi \hbar} \right)^{1/4} \exp \left( - \frac{m\omega}{2\hbar} x^2 \right) \\
\psi_n(x) & = \frac{1}{\sqrt{n!}} (a^\dagger)^n \psi_0(x) \\
a^\dagger \Ket{n} & = \sqrt{n+1} \Ket{n+1} \\
a \Ket{n} & = \sqrt{n} \Ket{n-1} \\
x & \propto a + a^\dagger \\
p & \propto a - a^\dagger
\end{align*}
*** Hydrogen Atom
\begin{align*}
V(\xxx) & = -\frac{Ze^2}{r} \\
\psi_{nlm}(\xxx) & = R_{nl}(r) Y_{lm}(\theta, \phi) \\
E_n & = -\frac{Z^2 e^2}{2n^2 a_0} \\
E_1 & = -13.6 \mathrm{eV}
\end{align*}

** Angular Momentum
*** Basics
\begin{align*}
[L_x, L_y] & = i\hbar L_z \\
L_z \Ket{l, m} & = \hbar m \Ket{l, m} \\
L^2 \Ket{l, m} & = \hbar^2 l (l+1) \Ket{l, m} \\
L_{\pm} & = L_x \pm i L_y \\
L_{\pm} \Ket{l, m} & = \hbar \sqrt{(l\mp m) (l \pm m + 1)} \Ket{l, m \pm 1} \\
\sigma_x & = \left( \begin{array}{cc} 0 & 1 \\ 1 & 0 \\ \end{array} \right) \\
\sigma_y & = \left( \begin{array}{cc} 0 & -i \\ i & 0 \\ \end{array} \right) \\
\sigma_z & = \left( \begin{array}{cc} 1 & 0 \\ 0 & -1 \\ \end{array} \right)
\end{align*}

- Allowed values of $m$: $-l, -l+1, \ldots, +l$

*** Addition of Angular Momentum
\begin{align*}
\JJ & = \LL_1 + \LL_2 \\
J^2 & = L_1^2 + L_2^2 + 2 \LL_1 \cdot \LL_2 \\
\LL_1 \cdot \LL_2 & = \frac{1}{2} ( J^2 - L_1^2 - L_2^2 ) \\
\Ket{j, j_z} & = \sum C_{l_1, l_2, m_1, m_2} \Ket{l_1, m_1; l_2, m_2} \\
j_z & = m_1 + m_2 \\
j & = l_1 + l_2, l_1 + l_2 -1, \ldots, \left| l_1 - l_2 \right| \\
\Ket{l_1 + l_2, l_1 + l_2} & = \Ket{l_1, l_1; l_2, l_2}
\end{align*}

- $\Ket{l_1+l_2 , j_z}$ is constructed by repeatedly applying $J_-$ to $\Ket{j, j}$.
- $\Ket{j, j_z}$ is constructed by walking down the allowed values of $j$ starting from $l_1 + l_2$
  - Construct $\Ket{j-1, j-1}$ from $\Ket{j, j-1}$ by finding the linear combination of allowed $m_1$ and $m_2$
    that is orthogonal to $\Ket{j, j-1}$
  - Construct $\Ket{j-1, j_z}$ by applying the lowering operator

** Approximation Methods
*** Perturbation Theory
\begin{align*}
H & = H_0 + V \\
V_{mn} & = \Braket{m^{(0)} | V | n^{(0)}} \\
E_n^{(1)} & = V_{nn} \\
\Ket{n^{(1)}} & = \sum_{m \neq n} \frac{V_{mn}}{E_n^{(0)} - E_m^{(0)}} \Ket{m^{(0)}} \\
E_n^{(2)} & = \sum_{m \neq n} \frac{\left| V_{nm} \right|^2}{E_n^{(0)} - E_m^{(0)}}
\end{align*}

- In a degenerate subspace where all states have energy $E_D$ under $H_0$, the first order correction to the energy is found via

\begin{align*}
0 & = \det [V - (E-E_D)]
\end{align*}

*** Variational Principle
\begin{align*}
E_0 & \le \frac{\Braket{\psi | H | \psi}}{\Braket{\psi | \psi}}
\end{align*}

*** WKB
\begin{align*}
p(x) & = \sqrt{2m(E - V(x)} \\
\int_{x_1}^{x_2} p(x') \, dx' & = \begin{dcases*}
                                        \left( n + \frac{1}{2} \right) \hbar \pi & no hard walls \\
                                        \left( n + \frac{3}{4} \right) \hbar \pi & one hard wall \\
                                        \left( n + 1 \right)           \hbar \pi & two hard walls \\
                                  \end{dcases*}
\end{align*}
where $x_1$ and $x_2$ are the classical turning points (roots of $p(x)$)

** Scattering (Born Approximation)
\begin{align*}
f^{(1)}(\mathbf{k}, \mathbf{k}') & = -\frac{m}{2\pi \hbar^2} \int d^3 x' \, e^{i(\mathbf{k} - \mathbf{k}') \cdot \xxx'} V(\xxx') \\
q & = \left| \mathbf{k} - \mathbf{k}' \right| = 2k \sin \frac{\theta}{2} \\
f^{(1)}(\theta) & = -\frac{2m}{\hbar^2} \frac{1}{q} \intoi r V(r) \sin qr \, dr \\
\td{\sigma}{\Omega} & = \left| f(\mathbf{k}', \mathbf{k}) \right|^2 \\
\mathrm{Im} f(\mathbf{k}, \mathbf{k}) & = \frac{k}{4\pi} \sigma_{tot}
\end{align*}

** Many Body Theory
- Boson wave functions are symmetric under any particle exchange
- Fermion wave functions are antisymmetric under any particle exchange
- For wave-functions with a spatial component and a spin component,
  - Boson: symmetric in both or antisymmetric in both
  - Fermion: symmetric in one and antisymmetric in the other


\newpage
* Statistical Physics
** Basics
\begin{align*}
S & = k_B \log \Omega \\
\pdc{S}{E}{N,V} & = \frac{1}{T} \\
dE & = -PdV + TdS + \mu dN \\
C_V & = \pdc{U}{T}{V, N}
\end{align*}
- Isothermal: $dT = 0$
- Adiabatic: $dS = 0$

