cram-sheet.org
** Canonical Ensemble
\begin{align*}
Z & = \sum_{states} e^{-\beta E} \\
\Braket{O} & = \frac{1}{Z} \sum_s O(s) e^{-\beta E} \\
\sum_s & \rightarrow \int \frac{d^3 x \, d^3 p}{h^3} \\
U & = -\pd{}{\beta} \log Z \\
A & = U - TS = -k_B T \log Z \\
dA & = -P dV - S dT
\end{align*}

- Partition function for an ideal gas molecule:
  \begin{align*}
    Z_1 & = \frac{V}{\lambda^3} \\
    \lambda & = \sqrt{\frac{h^2}{2\pi m k_B T}}
  \end{align*}
- In general, for a system of non-interacting particles, the total partition function obeys
  \begin{align*}
    Z & = \frac{1}{N!} Z_1^N
  \end{align*}
  where $Z_1$ is the partition function for one particle,
  and the $1/N!$ factor is necessary if the particles are indistinguishable

** Grand Canonical Ensemble
\begin{align*}
Z_G & = \sum_{states} e^{-\alpha N - \beta E} \\
U & = -\pd{}{\beta} \log Z_G \\
\mathcal{N} & = -\pd{}{\alpha} \log Z_G \\
\alpha & = -\beta \mu \\
y & = e^{-\alpha} = e^{\mu/k_B T} \\
Z_G & = \sum_N y^N Z(N, \beta) \\
\Phi_G & = -k_B T \log Z_G = U - TS - \mu \mathcal{N} = -PV
\end{align*}

** Quantum Statistical Mechanics
\begin{align*}
Z_G & = \prod_n [1 - \eta e^{-\beta (E_n - \mu)} ]^{-\eta} \\
\Braket{N_n} & = \frac{1}{y^{-1} e^{\beta E_n} - \eta} \\
D(E) & = \frac{g(E)}{V} = \frac{1}{V} \sum_\mathbf{k} (E - E_\mathbf{k}) \\
\varrho & = \int \frac{D(E)}{y^{-1} e^{\beta E} - 1} \, dE \\
\log Z_G & = -\eta V \intoi \log ( 1 - \eta ye^{-\beta E} ) D(E) \, dE
\end{align*}
- $\eta = +1$ for bosons, $-1$ for fermions

*** Bose Systems
- $y=1$ at Bose-Einstein Condensation, and in all cases for photons

*** Fermi Systems
\begin{align*}
\varrho & = \int_0^{E_F} D(E) \, dE
\end{align*}
- Any other Fermi parameter (Fermi temperature, Fermi momentum, etc)
  is determined from the relationship between energy and that parameter
  (E.g. $T_F = E_F/k_B$)
